In [1]:
import pandas as pd
import numpy as np

from datetime import date

### Importando dataset e-commerce

Para mas informacion del dataset, consulte en el siguiente [link](https://www.kaggle.com/datasets/carrie1/ecommerce-data)

In [2]:
ecommerce = pd.read_csv("data.csv")

In [3]:
ecommerce.head(5)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,12/1/2010 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,12/1/2010 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,12/1/2010 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,12/1/2010 8:26,3.39,17850.0,United Kingdom

In [4]:
ecommerce.shape

(541909, 8)

### cast de fechas y tratamiento de columnas Dias, mes, año

In [5]:
ecommerce.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
dtype: object

In [6]:
ecommerce["InvoiceDate"] = pd.to_datetime(ecommerce["InvoiceDate"])

In [7]:
ecommerce.dtypes

InvoiceNo              object
StockCode              object
Description            object
Quantity                int64
InvoiceDate    datetime64[ns]
UnitPrice             float64
CustomerID            float64
Country                object
dtype: object

In [8]:
ecommerce.head(1)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom

In [9]:
ecommerce["year"] = ecommerce["InvoiceDate"].dt.year
ecommerce["month"] = ecommerce["InvoiceDate"].dt.month
ecommerce["day"] = ecommerce["InvoiceDate"].dt.day

In [10]:
ecommerce.head(1)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,year,month,day
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,2010,12,1

#### Exploracion de paises

In [11]:
ecommerce["Country"].drop_duplicates()

0               United Kingdom
26                      France
197                  Australia
385                Netherlands
1109                   Germany
1236                    Norway
1404                      EIRE
5320               Switzerland
6421                     Spain
6608                    Poland
7134                  Portugal
7214                     Italy
7279                   Belgium
7986                 Lithuania
9783                     Japan
14938                  Iceland
20000          Channel Islands
20017                  Denmark
29732                   Cyprus
30078                   Sweden
31464                  Austria
31982                   Israel
34083                  Finland
38313                  Bahrain
69007                   Greece
69623                Hong Kong
70758                Singapore
72985                  Lebanon
89570     United Arab Emirates
100810            Saudi Arabia
103598          Czech Republic
119191                  Canada
152712             Unspecified
157299                  Brazil
164464                     USA
168149      European Community
217684                   Malta
395472                     RSA
Name: Country, dtype: object

### Ejercicios

**Ejercicio 1:** Por pais muestre cual fue el año en el que mejor ingreso se registro y su valor, adicional muestre cual fue el año con mas Invoices (Frecuencia) y otra columna con el total.

Nota: Note que el año con mejor ingreso no es lo mismo con el año con mas invoices, por ejemplo en 2019 Honduras en dos invoices se facturo 10,000. sin embargo, en 2020 se realizaron 20 invoices (pueda que en este año el ingreso de esas invoices hayan sumado 7,000 inferior al 2020) 

*recuerde que el ejemplo es inventado*

Ejemplo de como se deberia de ver el dataframe resultante:

In [12]:
pd.DataFrame({
    "country" : ["Honduras"]
    , "YearMejorIngreso" : [2019]
    , "ValorYearMejorIngreso" : [20000]
    , "YearMejorFrecuenciaInvoices": [2020]
    , "CantidadYearMejorFrecuenciaInvoices": [20]
})

,country,YearMejorIngreso,ValorYearMejorIngreso,YearMejorFrecuenciaInvoices,CantidadYearMejorFrecuenciaInvoices
0,Honduras,2019,20000,2020,20

*Answer:*

In [13]:
ecommerce["ingreso"] = ecommerce["UnitPrice"]*ecommerce["Quantity"]

In [14]:
ecommerce.head(3)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,year,month,day,ingreso
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom,2010,12,1,15.30
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom,2010,12,1,20.34
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom,2010,12,1,22.00

In [31]:
ecommerce1 = pd.DataFrame()

In [38]:
ecommerce1 = ecommerce.groupby(["Country", "year"], as_index=False).agg({"ingreso" : ["sum"] , "InvoiceDate" : ["count"]})

In [39]:
ecommerce1.columns = ecommerce1.columns.droplevel(1)

In [42]:
ecommerce1["yearI"] = ecommerce1["year"]

In [61]:
ecommerce1.columns = ["country", "YearMejorIngreso", "ValorYearMejorIngreso", "CantidadYearMejorFrecuenciaInvoices", "YearMejorFrecuenciaInvoices" ]

In [62]:
ecommerce1

,country,YearMejorIngreso,ValorYearMejorIngreso,CantidadYearMejorFrecuenciaInvoices,YearMejorFrecuenciaInvoices
0,Australia,2010,1005.100,35,2010
1,Australia,2011,136072.170,1224,2011
2,Austria,2010,257.040,9,2010
3,Austria,2011,9897.280,392,2011
4,Bahrain,2010,205.740,1,2010
...,...,...,...,...,...
56,USA,2011,1730.920,291,2011
57,United Arab Emirates,2011,1902.280,68,2011
58,United Kingdom,2010,676742.620,40125,2010
59,United Kingdom,2011,7511063.744,455353,2011
60,Unspecified,2011,4749.790,446,2011

no pasé de ahi

**Ejercicio 2:** Cual es el Top tres por año de los Invoices de lo mas facturado

Ejemplo de como se deberia de ver el dataframe resultante (Recuerde que este es un ejemplo inventado):

In [17]:
pd.DataFrame({
    "Year" : [2019,2019,2019,2020,2020,2020]
    , "Top" : [1,2,3,1,2,3]
    , "InvoiceNo" : [536365, 536999, 693365, 24987, 56832, 254232]    
    , "TotalInvoice": [30000,28000,27900,29000,25000,24600]
})

   Year  Top  InvoiceNo  TotalInvoice
0  2019    1     536365         30000
1  2019    2     536999         28000
2  2019    3     693365         27900
3  2020    1      24987         29000
4  2020    2      56832         25000
5  2020    3     254232         24600

*Answer:*

In [86]:
ecommerce2 = pd.DataFrame()

In [87]:
ecommerce2 = ecommerce.groupby(["year"],as_index=False).agg({"ingreso" : ["max"]})

In [88]:
ecommerce2.columns = ecommerce2.columns.droplevel(1)

In [89]:
ecommerce2.columns = ["year", "ingreso"]

In [100]:
ecommerce2_1 = pd.DataFrame()

In [101]:
ecommerce2_1 = ecommerce[["ingreso", "InvoiceNo"]]

In [102]:
ecommerce2.merge(ecommerce2_1, on="ingreso")

   year    ingreso InvoiceNo
0  2010   13541.33    537632
1  2011  168469.60    581483

de nuevo, hasta ahí llegué

**Ejercicio 3:** Genere el siguiente Dataset para cada uno de los clientes:

In [18]:
pd.DataFrame({
    "CustomerID" : [111,111,111]
    , "YearMonth" : ["2019-1","2019-2","2019-3"]
    , "TotalValorInvoices" : [20000,22000,0]    
    , "TotalCantidadInvoices" : [3,2,0]    
    , "FacturaSiguienteMes": [1,0,1]
})

,CustomerID,YearMonth,TotalValorInvoices,TotalCantidadInvoices,FacturaSiguienteMes
0,111,2019-1,20000,3,1
1,111,2019-2,22000,2,0
2,111,2019-3,0,0,1

*Ten en cuenta lo siguiente:*

Mediante el cross join puedo emular el producto cartesiano de dos vectores para obtener las combinaciones unicas de los valores de cada uno de ellos

In [19]:
df1 = pd.DataFrame( {"year": [2019,2020]} )
df2 = pd.DataFrame( {"Cliente": [111,112,113]} )

df2.merge(df1, how='cross')

   Cliente  year
0      111  2019
1      111  2020
2      112  2019
3      112  2020
4      113  2019
5      113  2020

*Observaciones:*

* TotalValorInvoices: La suma del total facturado por todas sus facturas
* TotalCantidadInvoices: La cantidad de facturas unicas realizadas en ese mes
* FacturaSiguienteMes: Una variable de respuesta que nos dice si al siguiente mes por ese cliente se encontro por lo menos una factura.

Note que por la logica de este dataset el ultimo año-mes encontrado en todo el dataset se va a descartar del resultado final por que no se sabe el valor del siguiente mes. 1: si se encuentra una factura al siguiente mes, 0: no se encuentra nada.

*Answer:*

**Ejercicio cuatro:** Cual es el top 3 de los productos que menos ingresos generan por Pais del ultimo año encontrado del dataset.

Ejemplo de como se deberia de ver el dataframe resultante (Recuerde que este es un ejemplo inventado):

In [20]:
pd.DataFrame({
    "Country" : ["Canada","Canada","Canada","Spain","Spain","Spain"]
    , "Top" : [1,2,3,1,2,3]    
    , "StockCode": [546,6886,665,656,888,668]
    , "Description": ["Product X","Product K","Product J","Product C","Product D","Product U"]
    , "TotalOnInvoices": [2000,2100,4000,3000,3800,3900]
})

  Country  Top  StockCode Description  TotalOnInvoices
0  Canada    1        546   Product X             2000
1  Canada    2       6886   Product K             2100
2  Canada    3        665   Product J             4000
3   Spain    1        656   Product C             3000
4   Spain    2        888   Product D             3800
5   Spain    3        668   Product U             3900

*Answer:*

In [104]:
ecommerce4 = pd.DataFrame()

In [107]:
ecommerce4 = ecommerce.groupby(["Country"], as_index=False).agg({"ingreso" : ["min"], "year" : ["min"]})

In [109]:
ecommerce4.columns = ecommerce4.columns.droplevel(1)

In [111]:
ecommerce4_1 = pd.DataFrame()

In [114]:
ecommerce4_1 = ecommerce[["StockCode", "Description","ingreso"]]

In [116]:
ecommerce4

                 Country    ingreso  year
0              Australia    -425.00  2010
1                Austria     -21.25  2010
2                Bahrain    -205.74  2010
3                Belgium     -19.95  2010
4                 Brazil      15.00  2011
5                 Canada       2.50  2011
6        Channel Islands    -293.00  2010
7                 Cyprus    -320.69  2010
8         Czech Republic     -35.76  2011
9                Denmark     -59.80  2010
10                  EIRE   -1917.00  2010
11    European Community      -8.50  2011
12               Finland     -80.00  2010
13                France   -8322.12  2010
14               Germany    -599.50  2010
15                Greece     -50.00  2011
16             Hong Kong   -2653.95  2011
17               Iceland       5.04  2010
18                Israel    -136.00  2010
19                 Italy     -89.55  2010
20                 Japan   -1591.20  2010
21               Lebanon      10.20  2011
22             Lithuania      13.20  2010
23                 Malta    -130.00  2011
24           Netherlands    -266.40  2010
25                Norway    -376.50  2010
26                Poland     -39.80  2010
27              Portugal   -1241.98  2010
28                   RSA       0.00  2011
29          Saudi Arabia     -14.75  2011
30             Singapore   -3949.32  2011
31                 Spain   -1715.85  2010
32                Sweden   -1188.00  2010
33           Switzerland    -179.00  2010
34                   USA     -74.88  2011
35  United Arab Emirates       3.48  2011
36        United Kingdom -168469.60  2010
37           Unspecified       0.19  2011